#include<stdio.h>
int main()
{
	//两个char类型的变量相加必然会发生整形提升
	unsigned char a = 200;
	unsigned char b = 100;
	unsigned char c = 0;
	c = a + b;
	//无符号的char - 0~255
	//有符号的char - -128~127
	//整形提升:无符号数补0，有符号数补符号位
	//200 - 00000000000000000000000011001000
	//截断，char类型的变量一个字节 
	//截断 - 11001000 - a
	//100 - 00000000000000000000000001100100
	//截断 - 01100100 - b

	//a提升后相加 - 00000000000000000000000011001000
	//b提升后相加 - 00000000000000000000000001100100
	//c提升       - 00000000000000000000000100101100 
	//由于c是char类型，于是会发生截断
	//c - 00101100 - 44
	//a+b - 00000000000000000000000100101100 - 300
	printf("%d %d", a + b, c);
	return 0;
}