# 交换机的基本配置

## 目标

1.掌握思科设备的命令行基础

2.会对交换机进行基本配置

3.会通过telnet和ssh对交换机进行远程管理

## 一、思科设备命令行基础

### 1.要想进入设备命令行界面需要一下几点

- 设备支持命令行
  - 去查看设备上的接口，是否有console
- 需要有console线
- 需要有超级终端软件进行连接
  - putty
  - secret CRT
  - xshell

### 2.命令行基础（所有命令必须使用英文输入）

- 思科设备上的命令行基础

  - 用户模式：查看统计信息（一般情况下用的非常少），用 “ > ” 表示

    - 用户模式切换到特权模式

    ```shell
    enable
    en        #这是命令的简写
    ```

  - 特权模式：查看并修改设备的配置（一般情况下都是查看居多），用 “ # ” 表示

    - 特权模式切换到全局模式

    ```shell
    configure terminal
    conf t     #命令简写
    ```

  - 全局模式：针对设备的整体配置参数，用“ (config)# ”表示

    - 全局模式切换到接口模式

    ```shell
    interface fasteternet0/1
    int f0/1     #命令简写
    ```

  - 接口模式：针对设备的接口修改配置参数，用“ (config-if)# ”表示

  - 进入对应模式只能一级一级进入

  - 返回对应模式，一级一级返回 使用 “ exit ”，如果想要快速返回特权模式，可以使用“ end ”

  - 当命令输错后会进入域名解析，此时可以

    ```shell
    Switch>dfds
    Translating "dfds" ...domain server (255.255.255.255)
    #快速终止按 ctrl+shift+6
    #永久不进行域名解析 
    Switch(config)#no ip domain-lookup     #注意模式
    ```

### 3.常见配置

- 给主机配置一个主机名

```shell
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname SW1
SW1(config)#
```

- 查看交换机MAC地址表（特权模式下）
  - 先给主机分配好IP地址，然后让两台主机通信一下（ping一下），然后再查看MAC地址表

```shell
show mac-address-table
```

![image-20230717174151163](C:\Users\hp\AppData\Roaming\Typora\typora-user-images\image-20230717174151163.png)

![image-20230717174155574](C:\Users\hp\AppData\Roaming\Typora\typora-user-images\image-20230717174155574.png)

![image-20230717174218488](C:\Users\hp\AppData\Roaming\Typora\typora-user-images\image-20230717174218488.png)

![image-20230717174239660](C:\Users\hp\AppData\Roaming\Typora\typora-user-images\image-20230717174239660.png)

- 交换机的双工模式（此模式需要使用接口模式才可以配置）

```shell
SW1>
SW1>en
SW1#conf t
SW1(config)#int f0/1
SW1(config-if)# duplex full
这是将Fa0/1接口配置为全双工模式


SW1(config-if)#duplex half
这是将Fa0/1接口配置为半双工模式
```

```shell
  auto  Enable AUTO duplex configuration

  full  Force full duplex operation

  half  Force half-duplex operation
  #这是交换机的三种双工模式
```

特权模式下，查看双工模式

```shell
SW1#show int f0/1
SW1#show int f0/2
```

- 配置接口速率（在接口模式下）

  ```shell
  SW1(config-if)#speed 10
  #意思是将此时的该接口的速率设置为10
  ```

  

- 配置console口的密码

```shell
SW1>en
SW1#conf t
SW1(config)#line console 0
#这里的数字0是console接口的代表，默认从0开始，接一个console就加一
SW1(config-line)#password 123456789
SW1(config-line)#login
#密码配置完记得一定要login一下
```

这样下一次进去的时候就要输入密码了

## 二、通过远程管理方式链接交换机

