# 交换机的基本配置

## 目标

1.掌握思科设备的命令行基础

2.会对交换机进行基本配置

3.会通过telnet和ssh对交换机进行远程管理

## 一、思科设备命令行基础

### 1.要想进入设备命令行界面需要一下几点

- 设备支持命令行
  - 去查看设备上的接口，是否有console
- 需要有console线
- 需要有超级终端软件进行连接
  - putty
  - secret CRT
  - xshell

### 2.命令行基础（所有命令必须使用英文输入）

- 思科设备上的命令行基础

  - 用户模式：查看统计信息（一般情况下用的非常少），用 “ > ” 表示

    - 用户模式切换到特权模式

    ```swift
    enable
    en        #这是命令的简写
    ```

  - 特权模式：查看并修改设备的配置（一般情况下都是查看居多），用 “ # ” 表示

    - 特权模式切换到全局模式

    ```swift
    configure terminal
    conf t     #命令简写
    ```

  - 全局模式：针对设备的整体配置参数，用“ (config)# ”表示

    - 全局模式切换到接口模式

    ```swift
    interface fasteternet0/1
    int f0/1     #命令简写
    ```

  - 接口模式：针对设备的接口修改配置参数，用“ (config-if)# ”表示

  - 进入对应模式只能一级一级进入

  - 返回对应模式，一级一级返回 使用 “ exit ”，如果想要快速返回特权模式，可以使用“ end ”

  - 当命令输错后会进入域名解析，此时可以

    ```swift
    Switch>dfds
    Translating "dfds" ...domain server (255.255.255.255)
    #快速终止按 ctrl+shift+6
    #永久不进行域名解析 
    Switch(config)#no ip domain-lookup     #注意模式
    ```

### 3.常见配置

- 给主机配置一个主机名

```swift
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname SW1
SW1(config)#
```

- 查看交换机MAC地址表（特权模式下）
  - 先给主机分配好IP地址，然后让两台主机通信一下（ping一下），然后再查看MAC地址表

```swift
SW1#show mac-address-table
```

![image-20230717174151163](C:\Users\hp\AppData\Roaming\Typora\typora-user-images\image-20230717174151163.png)

![image-20230717174155574](C:\Users\hp\AppData\Roaming\Typora\typora-user-images\image-20230717174155574.png)

![image-20230717174218488](C:\Users\hp\AppData\Roaming\Typora\typora-user-images\image-20230717174218488.png)

![image-20230717174239660](C:\Users\hp\AppData\Roaming\Typora\typora-user-images\image-20230717174239660.png)

- 交换机的双工模式（此模式需要使用接口模式才可以配置）

```swift
SW1>
SW1>en
SW1#conf t
SW1(config)#int f0/1
SW1(config-if)# duplex full
这是将Fa0/1接口配置为全双工模式


SW1(config-if)#duplex half
这是将Fa0/1接口配置为半双工模式
```

```swift
  auto  Enable AUTO duplex configuration

  full  Force full duplex operation

  half  Force half-duplex operation
  #这是交换机的三种双工模式
```

特权模式下，查看双工模式

```swift
SW1#show int f0/1
SW1#show int f0/2
```

- 配置接口速率（在接口模式下）

  ```swift
  SW1(config-if)#speed 10
  #意思是将此时的该接口的速率设置为10
  ```

  

- 配置console口的密码

```swift
SW1>en
SW1#conf t
SW1(config)#line console 0
#这里的数字0是console接口的代表，默认从0开始，接一个console就加一
SW1(config-line)#password 123456789
SW1(config-line)#login
#密码配置完记得一定要login一下
```

这样下一次进去的时候就要输入密码了

## 二、通过远程管理方式链接交换机（telnet,ssh）

1.telnet 是应用层协议   基于传输层TCP    默认端口号：23    采用的是明文密码方式  ，不安全，一般用于内网管理

2.ssh是应用层协议    基于传输层TCP   默认端口号：22    采用的是密文密码方式，相对来说比较安全，经常用于跨越互联网管理，也常用于远程管理linux操作系统

### 3.思路

#### telnet

- 既然是通过网络的方式远程管理设备，那么设备就必须配置IP地址，但是由于交换机上的接口都是交换接口，是不允许配置IP地址的，所以就直接对交换机的虚接口配置IP地址，默认情况下，交换机的默认虚接口就是vlan1接口

```swift
Switch>en                   #由用户模式进入特权模式
Switch#conf t               #由特权模式进入全局模式
Switch(config)#hostname SW1 #给交换机命名
SW1(config)#int vlan1       #进入vlan1虚接口
SW1(config-if)#ip address 192.168.100.100 255.255.255.0
                            #配置vlan1虚接口的IP地址和子网掩码
SW1(config-if)#no shutdown  #开启接口
```

- 配置设备的连接终端并直接设置密码（需要进入终端接口模式）和应用

  - 此时连接的终端是vty终端，和上面的console口比较相似

  ```swift
  SW1>en
  SW1#conf t
  SW1(config)#line vty 0 4      #进入了0-4的终端
  SW1(config-line)#password yhmjqx521134    #设置远程连接交换机                                            的密码
  SW1(config-line)#login        #应用表示直接使用密码登录
  ```

  ![image-20230718114732117](C:\Users\hp\AppData\Roaming\Typora\typora-user-images\image-20230718114732117.png)

- 创建连接用户名密码（全局模式下），配置设备的连接终端并应用

```swift
SW1#
SW1#conf t                #需要进入全局模式
SW1(config)#username zhangsan password 123   #设置远程连接交换机                                               的账户名和密码
SW1(config)#line vty 0 4      #配置设备
SW1(config-line)#login local    #应用于账户名和密码同时登陆
```

![image-20230718123444774](C:\Users\hp\AppData\Roaming\Typora\typora-user-images\image-20230718123444774.png)

第一个账户名和密码是连接交换机时需要输入的交换机和密码（因为应用了login local），第二个密码是进入特权模式的密码

#### ssh

这种情况的连接需要设置域名，创建域名不允许使用默认主机名,需要创建秘钥对，严格要求需要用户名密码

```
Switch(config)#hostname SW1       #全局模式下设置主机名
SW1#show ip ssh                   #先检查是否支持ssh
SW1#ip domain-name ymq.com        #然后设置域名
SW1(config)#crypto key generate rsa   #设置密钥对，随后输入秘钥对										的大小就好了
SW1(config)#ip ssh time-out 120     #配置超时时间
SW1(config)#ip ssh authentication-retries 5    #配置认证失败（输												错密码）的次数
SW1(config)#username ymq password 123   #创建用户名密码
SW1(config)#line vty 0 4           #进入连接
SW1(config-line)#login local       #应用
```



![image-20230718134752933](C:\Users\hp\AppData\Roaming\Typora\typora-user-images\image-20230718134752933.png)

![image-20230718134711747](C:\Users\hp\AppData\Roaming\Typora\typora-user-images\image-20230718134711747.png)



4.设置特权模式密码（需要进入全局模式）

```swift
SW1>en                           #进入特权模式
SW1#conf t                       #进入全局模式
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#enable password 123456789    #设置明文密码
SW1(config)#enable secret yhmjqx         #设置密文密码
SW1#show running-config          #查看当前配置文件命令
```

同时设置了明文密码和密文密码，那当然是安全等级高的密码生效了

![image-20230718122209077](C:\Users\hp\AppData\Roaming\Typora\typora-user-images\image-20230718122209077.png)

第一个密码是远程连接的密码，也就是给vty终端设置的密码，在这里我设置的是yhmjqx521134；

第二个密码是连接vty的特权模式所需要的密码，在这里我设置的是yhmjqx

**配置console口的密码和设置远程连接交换机的密码需要进入接口模式，设置远程连接交换机的账户名和密码以及进入特权模式的密码是在全局模式下**
