#include<stdio.h>
int main()
{
	int i = 0;
	long  a = 1;//要用来乘的数可不能是0
	int n = 0;
	int b = 0;
	int sum = 0;
	printf("请输入b的值");
	scanf("%d", &b);
	for (n = 1; n <= b; n++)
	{
		a = 1;//每一次都需要重新让a回到一再进行运算如果不加这个则算出来的就是sum=1!+1!2!+1!2!3!+1!2!3！4！......
		for (i = 1; i <= n; i++)//a需要重新定义为1
		{
			a = a*i;//a*=i
		}
		sum = sum + a;
	}
	//a=1*1									若不重新定义a的话   第一次a=1，i=1                a=1*1
	//a=1*1*2													第二次a=1, i=1*2              a=1*1*2
	//a=1*1*2*3													第三次a=2, i=1*2*3，则，这一次a=2*1*2*3,就不是阶乘了
	//现在所得的计算结果为sum=1！+2！+3！+4！+......
	printf("sum=%d", sum);
	return 0;
}