#include<stdio.h>
int main()
{
	float a = 5/ 2.0;//整数除法只能取得最后的商，因为/的两边都是整数，最后得到的结果也是整数，
	//可以通过添加小数点进行强转,同时需要注意不同类型对应的符号%f，%lf分别对应float，double
	int b = 5 % 2;//当然，取模当中左右操作数都必须是整数
	printf("%f\n", a);
	printf("%d\n", b);	
	int c = -2;  //-2	16
	int d=c >> 1;//-1	8
	printf("%d\n", d);
	//">>"是移位操作符，其移动的是二进制位c=16，其二进制位是000000000000000000000000010000
	//右移操作符：相当于除2
	//1.算术右移：
	//右边丢弃，左边补原符号位
	//2.逻辑右移：
	//右边丢弃，左边补0
	int e = 1;
	int f = e << 1;
	printf("%d\n", f);
	//左移操作符：左边丢弃，右边补 0，相当于乘2
	return 0;
}